ЛИС2/src/Documents/лис_ЖурналОпределенияКомпонентовВПочве/лис_ЖурналОпределенияКомпонентовВПочве.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>лис_ЖурналОпределенияКомпонентовВПочве</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

ЛИС2/src/InformationRegisters/лис_ЖурналОпределенияКомпонентовВПочве/лис_ЖурналОпределенияКомпонентовВПочве.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>лис_ЖурналОпределенияКомпонентовВПочве</name>
  <resources>
    <name>ДатаАнализа</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемПробы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </resources>
  <resources>
    <name>Методика</name>
    <type>
      <types>CatalogRef.МетодикиОпределенияИзмеренияАнализа</types>
    </type>
  </resources>
  <resources>
    <name>МассаНавески</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентПоправки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаПустойЧашки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаЧашкиСОстатком</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассоваяДоляПлотногоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОптическаяПлотность1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОптическаяПлотность2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОптическаяПлотность3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОптическаяПлотность4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОптическаяПлотностьСреднее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СодержаниеГумуса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассоваяДоляОрганическогоВещества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СодержаниеПоРасчету</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Погрешность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазбЭкстрактаК</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.лис_ЖурналОпределенияКомпонентовВПочве</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АктОтбора</name>
    <type>
      <types>DocumentRef.лис_АктОтбораПроб</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаОтбораПробы</name>
    <type>
      <types>CatalogRef.ТочкиКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОпределяемыйПоказатель</name>
    <type>
      <types>CatalogRef.КонтролируемыеПараметрыВПочвеДонныхОтложениях</types>
      <types>CatalogRef.ЗВВода</types>
      <types>CatalogRef.КонтролируемыеПоказателиВВоде</types>
      <types>CatalogRef.ФакторыФизическогоВоздействия</types>
      <types>CatalogRef.ЗВАтмосфера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШифрПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЛИС2/src/Enums/РазделыУчетаЭкоаналитическогоКонтроля/РазделыУчетаЭкоаналитическогоКонтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РазделыУчетаЭкоаналитическогоКонтроля</name>
  <enumValues>
    <name>ПромышленныеВыбросы</name>
  </enumValues>
  <enumValues>
    <name>АтмосферныйВоздух</name>
  </enumValues>
  <enumValues>
    <name>СточныеВоды</name>
  </enumValues>
  <enumValues>
    <name>ПриродныеВоды</name>
  </enumValues>
  <enumValues>
    <name>Почвы</name>
  </enumValues>
  <enumValues>
    <name>ДонныеОтложения</name>
  </enumValues>
  <enumValues>
    <name>ФизическиеФакторы</name>
  </enumValues>
  <enumValues>
    <name>АтмосферныеОсадки</name>
  </enumValues>
</mdclass:Enum>

ЛИС2/src/Documents/лис_АктОтбораПроб/лис_АктОтбораПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>лис_АктОтбораПроб</name>
  <registerRecords>AccumulationRegister.лис_ОтобранныеПробы</registerRecords>
  <registerRecords>InformationRegister.лис_ОтборПроб</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПлана</name>
    <type>
      <types>DocumentRef.лис_ПланОтбораПроб</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтбора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПроб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ВодныеОбъекты</types>
      <types>CatalogRef.ПроизводственныеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОтбораПроб</name>
    <type>
      <types>CatalogRef.ВодныеОбъекты</types>
      <types>CatalogRef.ИсточникиЗагрязнения</types>
      <types>CatalogRef.Водозаборы</types>
      <types>CatalogRef.СелитебныеЗоны</types>
      <types>CatalogRef.Скважины</types>
      <types>CatalogRef.СанитарноЗащитныеЗоны</types>
      <types>CatalogRef.ВыпускиВВоду</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦельОтбораПроб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборудованиеДляОтбораПроб</name>
    <type>
      <types>CatalogRef.лис_ЛабораторноеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>КонсервацияУсловияПроведенияАнализа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияТранспортировкиИХраненияПроб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураВодыПриОтборе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураВоздухаВМестеОтбора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативныеДокументы</name>
    <type>
      <types>CatalogRef.ЗаконодательныеИНормативныеТребования</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНД</name>
    <type>
      <types>CatalogRef.ЗаконодательныеИНормативныеТребования1</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеВыдал</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеПолучил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтобралПробу</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисутствовалПриОтбореПроб</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПробуПринял</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатНаружнегоОсмотраПроб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяИДатаДоставкиВЛабораторию</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделУчета</name>
    <type>
      <types>EnumRef.РазделыУчетаЭкоаналитическогоКонтроля</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пробы</name>
    <attributes>
      <name>ТочкаОтбораПробы</name>
      <type>
        <types>CatalogRef.ТочкиКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>ОпределяемыйПоказатель</name>
      <type>
        <types>CatalogRef.ВеществаИПараметрыВАтмосферныхОсадках</types>
        <types>CatalogRef.КонтролируемыеПараметрыВПочвеДонныхОтложениях</types>
        <types>CatalogRef.ЗВВода</types>
        <types>CatalogRef.КонтролируемыеПоказателиВВоде</types>
        <types>CatalogRef.ФакторыФизическогоВоздействия</types>
        <types>CatalogRef.ЗВАтмосфера</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕмкостиДляОтбораПроб</name>
      <type>
        <types>CatalogRef.лис_ЛабораторныеПринадлежности</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПробы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>КонсервантыДляАнализа</name>
      <type>
        <types>CatalogRef.лис_ЛабораторныеРеактивы</types>
      </type>
    </attributes>
    <attributes>
      <name>ШифрПробы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЛИС2/src/Documents/лис_ЖурналОпределенияКомпонентовВПочве/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Основное.Отбор.Элементы.Очистить(); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Основное, "Документ", Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно,,Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Основное.Отбор.Элементы.Очистить(); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Основное, "Документ", Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно,,Истина);

КонецПроцедуры


&НаКлиенте
Процедура ОсновноеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = новый Структура;
	ПараметрыФормы.Вставить("Документ", Объект.Ссылка);
	ПараметрыФормы.Вставить("АктОтбора", Элементы.Основное.ТекущиеДанные.АктОтбора);
	
	ОткрытьФорму("РегистрСведений.лис_ЖурналОпределенияКомпонентовВПочве.Форма.ФормаЗаписейПоАкту", ПараметрыФормы, ЭтаФорма, , ВариантОткрытияОкна.ОтдельноеОкно);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.лис_АктОтбораПроб") Тогда
		ОсновноеОбработкаВыбораНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОсновноеОбработкаВыбораНаСервере(АктОтбора)
	
	Объект.Организация = АктОтбора.Организация;
	Объект.Лаборатория = АктОтбора.Лаборатория;

	НЗ = РегистрыСведений.лис_ЖурналОпределенияКомпонентовВПочве.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Объект.Ссылка);
	НЗ.Прочитать();
	
	Для Каждого Строка Из АктОтбора.Пробы Цикл
		
		НоваяСтрока = НЗ.Добавить();
		НоваяСтрока.Документ = Объект.Ссылка;
		НоваяСтрока.АктОтбора = АктОтбора;
		НоваяСтрока.ТочкаОтбораПробы = Строка.ТочкаОтбораПробы;
		НоваяСтрока.ОпределяемыйПоказатель = Строка.ОпределяемыйПоказатель;
		НоваяСтрока.ШифрПробы = Строка.ШифрПробы;
		НоваяСтрока.ОбъемПробы = Строка.ОбъемПробы;
		НоваяСтрока.ЕдиницаИзмерения = Строка.ЕдиницаИзмерения;
		НоваяСтрока.ДатаАнализа = Объект.Дата;
		
	КонецЦикла;
	
	НЗ.Записать(Истина);
	
	Элементы.Основное.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьИзАкта(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЭтотОбъект.Записать(); 
		Основное.Отбор.Элементы.Очистить(); 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Основное, "Документ", Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли;
		
	РазделУчета = Новый Массив;
	РазделУчета.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.ДонныеОтложения"));
	РазделУчета.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаЭкоаналитическогоКонтроля.Почвы"));
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("РазделУчета", РазделУчета);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("Документ.лис_АктОтбораПроб.ФормаВыбора", ПараметрыФормы, Элементы.Основное);
	
КонецПроцедуры

#КонецОбласти
